src/cf/InformationRegisters/СоответствиеНоменклатурыСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСАТУРН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПАТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПАТСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияСАТУРНБПВызовСервера/Ext/Module.bsl
Функция СопоставленнаяНоменклатураСАТУРН(Реквизиты) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ПАТ", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Реквизиты.Номенклатура);
	Запрос.УстановитьПараметр("ПАТ", Реквизиты.ПАТ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеНоменклатурыСАТУРН.ПАТ КАК ПАТ,
	|	СоответствиеНоменклатурыСАТУРН.ПАТ = &ПАТ КАК ПолноеСоответствие
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыСАТУРН КАК СоответствиеНоменклатурыСАТУРН
	|ГДЕ
	|	СоответствиеНоменклатурыСАТУРН.Номенклатура = &Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	ПолноеСоответствие Убыв";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Выборка.Следующий();
		Если Выборка.ПолноеСоответствие Тогда
			Результат.ПАТ = Выборка.ПАТ;
		КонецЕсли;
	ИначеЕсли Выборка.Следующий() Тогда
		Результат.ПАТ = Выборка.ПАТ;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

Функция ПолучитьУпаковкуПоЕдиницеИзмерения(ЕдиницаИзмерения) Экспорт 
	
	Возврат ИнтеграцияСАТУРНБП.ПолучитьУпаковкуПоЕдиницеИзмерения(ЕдиницаИзмерения);
	
КонецФункции

Функция ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура) Экспорт
	
	Возврат Номенклатура.ЕдиницаИзмерения;
	
КонецФункции

Функция ТаблицаЗначенийВСтруктуру(Таблица) Экспорт
	
	Результат = Новый Структура;
	
	Для Каждого КолонкаТаблицы Из Таблица.Колонки Цикл
		Результат.Вставить(КолонкаТаблицы.Имя, Таблица[0][КолонкаТаблицы.Имя]);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыПодбораНоменклатуры(ДатаРасчетов, ЗаголовокПодбора, ИмяТаблицы) Экспорт
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказыватьЦены"			, Ложь);
	ПараметрыФормы.Вставить("ТипЦен"        			, Неопределено);
	ПараметрыФормы.Вставить("ЕстьЦена"      			, Ложь);
	ПараметрыФормы.Вставить("ЕстьКоличество"			, Истина);
	ПараметрыФормы.Вставить("ДатаРасчетов"  			, ДатаРасчетов);
	ПараметрыФормы.Вставить("Валюта"        			, СобытияФормЗЕРНОБПВызовСервера.ВалютаРегламентированногоУчета());
	ПараметрыФормы.Вставить("Склад"         			, Справочники.Склады.ПустаяСсылка());
	ПараметрыФормы.Вставить("Заголовок"     			, ЗаголовокПодбора);
	ПараметрыФормы.Вставить("ВидПодбора"    			, "");
	ПараметрыФормы.Вставить("ИмяТаблицы"    			, ИмяТаблицы);
	ПараметрыФормы.Вставить("Организация"   			, Справочники.Организации.ПустаяСсылка());
	ПараметрыФормы.Вставить("Подразделение" 			, Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ПараметрыФормы.Вставить("Услуги"        			, Ложь);
	ПараметрыФормы.Вставить("ПоказыватьОстатки"			, Истина);
	ПараметрыФормы.Вставить("ДопустимыеВидыПродукции"	, "");
	
	Возврат ПараметрыФормы;
	
КонецФункции
